


&НаСервере
Функция ПроверитьСоединение() Экспорт
	Обработка = Обработки.РаботаСKafkaЧерезВК.Создать();
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");
	
	Обработка.КлиентАдминистрирования_Закрыть();	
	сткРезультатВыполнения = Обработка.СоздатьКлиентАдминистрирования();
	Если Не сткРезультатВыполнения.булУспешно Тогда
		сткРезультат.стрОписаниеОшибки = сткРезультатВыполнения.стрОписаниеОшибки;	
		Возврат сткРезультат;
	КонецЕсли;
	
	//Просмотр_НастройкиГлобальные = Новый ТаблицаЗначений;
	//стрНастройка = Просмотр_НастройкиГлобальные.Добавить();
	//стрНастройка.Key =  "socket.timeout.ms";
	//стрНастройка.Value = "30000"; 
	//Для Каждого Строка Из Просмотр_НастройкиГлобальные Цикл
	//	сткРезультатВыполнения = Обработка.КлиентАдминистрирования_УстановитьПараметрГлобальный(Строка.Key, Строка.Value);
	//	Если Не сткРезультатВыполнения.булУспешно Тогда
	//		сткРезультат.стрОписаниеОшибки = сткРезультатВыполнения.стрОписаниеОшибки;	
	//		Возврат сткРезультат;
	//	КонецЕсли;
	//КонецЦикла;
		
	сткРезультатВыполнения = Обработка.КлиентАдминистрирования_Инициализировать("192.168.250.155:29092");
	Если Не сткРезультатВыполнения.булУспешно Тогда   
		сткРезультат.стрОписаниеОшибки = сткРезультатВыполнения.стрОписаниеОшибки;	
		Возврат сткРезультат;
	КонецЕсли;
	
	сткРезультат.булУспешно = Истина;
	Возврат сткрезультат;

КонецФункции
