
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.Статус = Перечисления.СтатусДокумента.НеСогласован;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                               
	Если ПроверитьСтатусДокумента(Объект.Статус, "Согласован") Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтправитьВДО.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтправитьВДО(Команда)
	Если Модифицированность Тогда
		Ответ = Ждать ВопросАсинх("Требуется записать документ перед отправкой!!!", РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		ЭтотОбъект.Записать();
	КонецЕсли;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Объект);
	Строка_JSON = ЗаписьJSON.Закрыть();
	ОтправитьВДОСервер(Строка_JSON);
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ОтправитьВДОСервер(Строка_JSON)
	ОбработкаОтправки = Обработки.РаботаСKafkaЧерезВК.Создать();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если ПроверитьСтатусДокумента(Объект.Статус, "Согласован") Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтправитьВДО.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Функция ПроверитьСтатусДокумента(Статус, СтатусПроверки)
	Если Статус = Перечисления.СтатусДокумента[СтатусПроверки] Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Асинх Процедура Добавить(Команда)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	//Фильтр = НСтр("ru = 'Текст'; en = 'Text'")
	//    + "(*.txt)|*.txt";
	//ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	МассивФайлов = Ждать ДиалогОткрытияФайла.ВыбратьАсинх();
	
	//Если ДиалогОткрытияФайла.Выбрать() Тогда
	//    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	    Для Каждого ИмяФайла Из МассивФайлов Цикл
			//ВыбФайл = Новый Файл(ИмяФайла);
			СтрокаФайла = Объект.Файлы.Добавить();
			СтрокаФайла.Наименование = ИмяФайла;
			////Сообщить(ИмяФайла
			////    + НСтр("ru = '; Размер = '; en = '; Size = '")
			////    + ВыбФайл.Размер());
			//СтрокаФайла.
	    КонецЦикла;
	//Иначе
	//    Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	//КонецЕсли;
КонецПроцедуры
