 
Процедура ИсполняемыеСценарии() Экспорт
	ЮТТесты.
		ДобавитьТестовыйНабор("Проверка работы Kafka").
		ДобавитьТест("Проверка_Соединения_Kafka", "Проверка соединения Kafka")
		
	;
	ЮТТесты.
		ДобавитьТестовыйНабор("Проверка документов").
		ДобавитьТест("Документ", "Проверка реквизитов")
	;
	
КонецПроцедуры       

Процедура Проверка_Соединения_Kafka() Экспорт
	Результат = ОбщийМодульРаботаСКафка.ПроверитьСоединение();
	
	ЮТест.ОжидаетЧто(Результат.булУспешно).Равно(Истина);
КонецПроцедуры    

Процедура Документ() Экспорт
	Документ = Документы.ДокументЗаявление.НайтиПоНомеру("000000008");
	                                            
	ЮТест.ОжидаетЧто(Документ)
		.Свойство("Статус").Заполнено()
		.Свойство("ТипЗаяления").Заполнено();
КонецПроцедуры